{
  "base_model_name_or_path": "google/flan-t5-small",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "megatron_core": "megatron.core",
  "peft_type": "LORA",
  "r": 8,
  "alpha_pattern": {},
  "rank_pattern": {},
  "target_modules": ["v", "q"],
  "task_type": "SEQ_2_SEQ_LM"
}
